{
    "date": "2025-12-26",
    "total_items": 24,
    "news": [
        {
            "title": "Airlines cancel more than 1,200 flights ahead of winter storm. Here's what to know",
            "description": "Airlines waived change fees ahead of a large winter storm and low temperatures after the busy Christmas holiday.",
            "category": "Top News"
        },
        {
            "title": "Nvidia-Groq deal is structured to keep 'fiction of competition alive,' analyst says",
            "description": "Groq's description of its Nvidia deal as a \"non-exclusive licensing agreement\" mimics other recent big AI transactions orchestrated by U.S. tech giants.  ",
            "category": "Top News"
        },
        {
            "title": "Oracle shares on pace for worst quarter since 2001 as new CEOs face concerns about AI build-out",
            "description": "Investors want to know if Oracle, under new CEOs Clay Magouyrk and Mike Sicilia, can pay for and deliver data centers packed with Nvidia chips for OpenAI.",
            "category": "Top News"
        },
        {
            "title": "Over 300,000 student loan borrowers were denied a new repayment plan, court filing shows — here's why",
            "description": "Trump officials rejected 327,955 income-driven repayment plan requests from student loan borrowers, according to a recent court filing. Here's what to know. ",
            "category": "Top News"
        },
        {
            "title": "S&P 500 hits fresh record high as Wall Street heads for winning week: Live updates",
            "description": "The S&P 500 reached a new high on Friday and was pacing for weekly gains as traders came back from the Christmas holiday.",
            "category": "Top News"
        },
        {
            "title": "Time to sell silver and buy gold, says Carter Worth",
            "description": "Carter Worth breaks down the technicals between silver and gold. ",
            "category": "Top News"
        },
        {
            "title": "Google is rolling out a new feature allowing users to change their Gmail address ",
            "description": "Google says it is rolling out a feature that lets users change their Gmail addresses in a long-requested update to their email policy. ",
            "category": "World News"
        },
        {
            "title": "The 'Trump-class' battleship faces a large obstacle in its way: Reality",
            "description": "Even if it were technically feasible, the cost of building the battleship would be prohibitive.",
            "category": "World News"
        },
        {
            "title": "There are two risks the market isn’t pricing in heading into the new year, according to Apollo’s Torsten Slok",
            "description": "Apollo chief economist Torsten Slok said that the Supreme Court potentially striking down President Trump's tariffs could be a big headline risk for markets.",
            "category": "World News"
        },
        {
            "title": "Waymo pauses robotaxis in SF again due to flash flood warnings on Christmas Day",
            "description": "Waymo again paused it robotaxi service, citing a flash flood warning on Christmas Day.",
            "category": "US News"
        },
        {
            "title": "Gas prices fall to four-year lows as millions embark on holiday road trips",
            "description": "The average price of unleaded gasoline in the U.S. is at its lowest since 2021, according to AAA.",
            "category": "Economic News"
        },
        {
            "title": "Trust these numbers? Economists see a lot of flaws in delayed CPI report showing downward inflation",
            "description": "Thursday saw the release of a much lighter-than-expected inflation report for November, and economists are already questioning its significance.",
            "category": "Economic News"
        },
        {
            "title": "November consumer prices rose at a 2.7% annual rate, lower than expected, delayed data shows",
            "description": "Economists polled by Dow Jones expected CPI to have risen 3.1% on an annualized basis.",
            "category": "Economic News"
        },
        {
            "title": "Bank of England cuts interest rates, in welcome Christmas boost for consumers",
            "description": "The Bank of England voted to cut interest rates from 4% to 3.75% in its last monetary policy move of 2025.",
            "category": "Economic News"
        },
        {
            "title": "November's inflation report is the first to be released after the shutdown. Here's what to expect",
            "description": "November's CPI report is expected to show the annual inflation rate at 3.1%, according to economists polled by Dow Jones.",
            "category": "Economic News"
        },
        {
            "title": "Watch Fed Governor Christopher Waller speak on interest rates and the race to succeed Powell",
            "description": "Waller is one of the five finalists considered for to replace Fed Chairman Jerome Powell when his term expires in May. ",
            "category": "Economic News"
        },
        {
            "title": "Nvidia's Groq deal, S&P's winning week, leather tariffs and more in Morning Squawk",
            "description": "Here are five key things investors need to know to start the trading day.",
            "category": "Technology News"
        },
        {
            "title": "Wall Street wrote off Palantir as too expensive. Retail investors can't get enough",
            "description": "The stock, which made its market debut in 2020, is an indisputable star of the retail investing world.",
            "category": "Technology News"
        },
        {
            "title": "Monetizers vs manufacturers: How the AI market could splinter in 2026",
            "description": "AI infrastructure firms are set to win from the evolution of once asset-light Big Tech firms.",
            "category": "Technology News"
        },
        {
            "title": "DOJ says more than 1 million potential Epstein files newly uncovered",
            "description": "A bipartisan group of Senators on Wednesday said the Trump administration violated the law by failing to release the records in full last week.",
            "category": "Politics News"
        },
        {
            "title": "Libyan army's chief dies in plane crash in Turkey",
            "description": "The Libyan army's chief of staff, Mohammed Ali Ahmed Al-Haddad, died in a plane crash on Tuesday after leaving Turkey's capital Ankara, the prime minister of Libya's internationally recognised government said, adding that four others were on the jet as well.",
            "category": "Politics News"
        },
        {
            "title": "Supreme Court rejects Trump's bid to send National Guard to Chicago",
            "description": "In an unsigned decision released on Tuesday, the court said Trump lacked the authority to federalize troops in Chicago.",
            "category": "Politics News"
        },
        {
            "title": "Epstein files: Latest batch from DOJ includes a personal letter, emails and heavily redacted documents",
            "description": "The release comes amid intense scrutiny from congressional lawmakers and victims over the DOJ's handling of the Epstein files.",
            "category": "Politics News"
        },
        {
            "title": "Greenland PM rebukes Trump special envoy overture",
            "description": "President Donald Trump on Sunday appointed Louisiana Gov. Jeff Landry as a \"special envoy\" to Greenland. ",
            "category": "Politics News"
        }
    ]
}