{
    "date": "2025-11-16",
    "total_items": 29,
    "news": [
        {
            "title": "Trump reverses stance on Epstein records, presses Republicans to support release",
            "description": "U.S. President Donald Trump has called on Congressional Republicans to vote to release files related to deceased convicted sex offender Jeffrey Epstein. ",
            "category": "Top News"
        },
        {
            "title": "Stock futures are little changed to start the week: Live updates",
            "description": "The moves followed a choppy week in which valuation fears, a rotation within the market and a recalibration of Fed rate cut expectations pressured the AI trade.",
            "category": "Top News"
        },
        {
            "title": "All three of the core premises behind the bull market are coming under questioning",
            "description": "Mike Santoli breaks down the recent turbulence seen in the market and whether it is a sign of a bigger washout to come.",
            "category": "Top News"
        },
        {
            "title": "Alibaba is helping Chinese military target the U.S., White House memo claims: FT  ",
            "description": "The Financial Times cited a White House memo that alleged Alibaba was providing tech support to Chinese military 'operations' against targets in the U.S.",
            "category": "Top News"
        },
        {
            "title": "Former Fed Gov. Adriana Kugler violated trading rules while at central bank: ethics report ",
            "description": "The Federal Reserve's internal watchdog was notified earlier this year about stock trades from 2024 disclosed by then-Gov Adriana Kugler.",
            "category": "Top News"
        },
        {
            "title": "Goldman Sachs unveils its 10-year playbook — and AI is at the heart of it ",
            "description": "Cyclical forces periodically influence markets, but Goldman Sachs expect long-term drivers to be structural.",
            "category": "Top News"
        },
        {
            "title": "Japan to dispatch senior envoy to China, NHK says, as travel warning drives tourism selloff in Tokyo",
            "description": "Japan's tourism-related stocks fell amid worsening diplomatic standoff between the two nations after Beijing issued a travel and study advisory.",
            "category": "World News"
        },
        {
            "title": "Japan's economy contracts for the first time in six quarters as exports, residential investment drag ",
            "description": "On an annualized basis, private demand fell 1.8%, dragged lower by a more than 32% drop in residential investments.",
            "category": "World News"
        },
        {
            "title": "Asia-Pacific markets trade mixed as investors assess intensifying China-Japan tensions",
            "description": "Asia-Pacific markets were set to open lower on Monday as investors look toward a slate of economic data in the region.",
            "category": "World News"
        },
        {
            "title": "CNBC Daily Open: The laws of politics can be changed, but not economics",
            "description": "Just as AI steps away from the spotlight, tariffs entered the stage, like the next act in a Shakespearean play. ",
            "category": "World News"
        },
        {
            "title": "New York Fed met with Wall Street firms about key lending facility: FT",
            "description": "The Fed sought feedback from dealers on the use of the central bank's standing repo facility, a permanent lending tool that acts as a backstop for markets.",
            "category": "US News"
        },
        {
            "title": "Inside Ford's new world headquarters: Scratch kitchens, rotisserie chickens and design secrets",
            "description": "Ford's new 2.1-million-square-foot headquarters in Dearborn, Michigan, is ceremoniously opening Sunday, although construction is expected to continue into 2027.",
            "category": "US News"
        },
        {
            "title": "The government shutdown is over. The air traffic controller shortage is not",
            "description": "Staffing shortages of air traffic controllers forced airlines to chop flights and delay thousands of others that disrupted travel plans of 5 million people.",
            "category": "US News"
        },
        {
            "title": "Woman pleads guilty to lying about astronaut wife accessing bank account from Space Station",
            "description": "Summer Worden faces a possible maximum sentence of five years in prison in the case, which involves false allegations she made against astronaut Anne McClain.",
            "category": "US News"
        },
        {
            "title": "September jobs report will be out Thursday as first data since shutdown starts to trickle out",
            "description": "The departments of Labor and Commerce had not posted revised schedules as of Friday morning, but updates are expected soon.",
            "category": "Economic News"
        },
        {
            "title": "Trump tariffs are helping drive U.S. beef prices to new highs",
            "description": "President Trump's tariffs are adding to higher beef prices, along with drought and parasites in a stressed U.S. beef supply chain.",
            "category": "Economic News"
        },
        {
            "title": "Atlanta Fed President Bostic says he'll leave position when his term expires in February",
            "description": "Atlanta Federal Reserve President Raphael Bostic said Wednesday he will be leaving his position when his term expires in February.",
            "category": "Economic News"
        },
        {
            "title": "The shutdown put jobs and inflation data on hold. Here's when it could be back — and what it might say",
            "description": "Economic data releases — payroll and jobs reports, CPI and PPI — have lagged during the government shutdown and likely will take some time to get rolling again.",
            "category": "Economic News"
        },
        {
            "title": "'Ghost job' postings are adding another layer of uncertainty to the stalling jobs picture",
            "description": "Since the beginning of 2024, job openings have outnumbered hires by more than 2.2 million a month.",
            "category": "Economic News"
        },
        {
            "title": "Stock investors are buoying the economy. A labor market breakdown could end that",
            "description": "Government labor data could paint a darker economic picture, leading to a market slide that would throw cold water on the outlook of those who are well off. ",
            "category": "Economic News"
        },
        {
            "title": "Americans are heating their homes with bitcoin this winter",
            "description": "Winter across the U.S. means big bills for home heating oil, gas and electric furnaces, but in some cases, crypto like bitcoin is paying to keep Americans warm.",
            "category": "Technology News"
        },
        {
            "title": "These underperforming groups may deliver AI-electric appeal. Here's why.",
            "description": "Industrial and infrastructure stocks may soon share the spotlight with the artificial intelligence trade.",
            "category": "Technology News"
        },
        {
            "title": "How tariffs and AI are giving secondhand platforms like ThredUp a boost",
            "description": "Tariffs are driving shoppers to resale platforms in the U.S., and companies like ThredUp are cashing in. ",
            "category": "Technology News"
        },
        {
            "title": "AI anxiety on the rise: Startup founders react to bubble fears",
            "description": "Short sellers like Michael Burry and Jim Chanos are circling, warning that the AI buildout isn’t a one-time investment but a recurring cost wave. ",
            "category": "Technology News"
        },
        {
            "title": "Google and Disney reach deal to restore ESPN, ABC to YouTube TV",
            "description": "The deal comes after a two-week standoff that resulted in channels like ESPN, ABC and others going dark on the popular YouTube TV streaming service. ",
            "category": "Technology News"
        },
        {
            "title": "Data centers are concentrated in these states. Here's what's happening to electricity prices",
            "description": "Residential utility bills rose 6% on average nationwide in August compared with the same period last year, according to the Energy Information Administration.",
            "category": "Technology News"
        },
        {
            "title": "Border Patrol commander touts dozens of North Carolina arrests, leaving residents 'overwhelmed'",
            "description": "A top Border Patrol commander touted dozens of arrests in North Carolina's largest city on Sunday.",
            "category": "Politics News"
        },
        {
            "title": "Trump buys at least $82 million in bonds since late August, financial disclosures show",
            "description": "Trump bought at least $82 million in corporate and municipal bonds from late August to early October, financial disclosures made public on Saturday showed.",
            "category": "Politics News"
        },
        {
            "title": "MAGA rift grows as Trump feuds with Marjorie Taylor Greene before key 2026 midterm elections",
            "description": "President Donald Trump has called it quits with one of his most stalwart MAGA-world supporters, calling Georgia Rep. Marjorie Taylor Greene \"'Wacky' Marjorie.\"",
            "category": "Politics News"
        }
    ]
}