{
    "date": "2025-12-20",
    "total_items": 27,
    "news": [
        {
            "title": "Google was at risk of losing its dominance — until it promoted this AI executive",
            "description": "Josh Woodward, a 16-year Google veteran, is tasked with running the Gemini app and going head-to-head with OpenAI in the booming generative AI market. ",
            "category": "Top News"
        },
        {
            "title": "Epstein files released by DOJ",
            "description": "President Donald Trump signed the Epstein Files Transparency Act in November.",
            "category": "Top News"
        },
        {
            "title": "Abel takes over for Buffett in less than two weeks. Wall Street has some advice for new Berkshire CEO",
            "description": "With Warren Buffett's planned departure as Berkshire Hathaway's CEO less than two weeks away, some on Wall Street have advice for incoming CEO Greg Abel.",
            "category": "Top News"
        },
        {
            "title": "Roomba's bankruptcy may wreck a lot more than one robot vacuum maker",
            "description": "Roomba's bankruptcy should serve as a warning sign to many small companies that big tech may not be able to come to the rescue, say M&A experts.",
            "category": "Top News"
        },
        {
            "title": "S&P 500 coasts to a third year of superior returns. Three key questions for Wall Street entering 2026",
            "description": "While the swing factors are inherently unpredictable, there seem a few broad questions hovering over the market as 2025 slips into the past.",
            "category": "Top News"
        },
        {
            "title": "Bank of America says Nvidia and these stocks are its top picks for 2026",
            "description": "Bank of America named its favorite stocks to buy in 2026",
            "category": "Top News"
        },
        {
            "title": "Italy's Telecom Italia wins $1.2 billion court payout, eyes savings share conversion",
            "description": "The amount TIM is entitled to is roughly double the original licence fee, worth slightly more than 500 million euros, due to revaluation and accrued interest.",
            "category": "World News"
        },
        {
            "title": "I stayed in a $40 capsule hotel as return to office mandates drive workers back to the city",
            "description": "RTO mandates has workers who don't live in cities scrambling to find inexpensive ways of staying in the city without resorting to hostels. ",
            "category": "World News"
        },
        {
            "title": "U.S. seizes vessel off Venezuelan coast: Reuters",
            "description": "The move comes just days after U.S. President Donald Trump announced a \"blockade\" of all sanctioned oil tankers entering and leaving Venezuela.",
            "category": "World News"
        },
        {
            "title": "Check out the winning hedge fund strategies of 2025",
            "description": "As 2025 draws to a close, hedge funds' annual performances face close scrutiny among investors.",
            "category": "World News"
        },
        {
            "title": "Former Trump advisor Dina Powell McCormick leaves Meta board after eight-month stint",
            "description": "Dina Powell McCormick, who was a member of President Donald Trump's first administration, has resigned from Meta's board of directors.",
            "category": "US News"
        },
        {
            "title": "Musk's $56 billion Tesla pay package must be restored as court rules cancellation was too extreme",
            "description": "Shareholder Richard J. Tornetta brought the suit, accusing Musk and the Tesla board of a breach of fiduciary duties.",
            "category": "US News"
        },
        {
            "title": "Nine of the largest pharma companies ink deals with Trump to lower drug prices",
            "description": "President Donald Trump has pushed to lower drug prices for Americans, which are on average nearly three times higher than overseas.",
            "category": "US News"
        },
        {
            "title": "Wall Street heads into the new week with a year-end rally in doubt",
            "description": "December is a seasonally strong period for stocks. But an unusually weak stretch has investors wary. ",
            "category": "US News"
        },
        {
            "title": "Santa Claus rally: What is it and will it occur this year?",
            "description": "As the new year draws closer, eyes are turning to Wall Street to see whether it will pull off the coveted Santa Claus rally.",
            "category": "US News"
        },
        {
            "title": "Trump's name added to Kennedy Center building a day after board votes to rename DC theater",
            "description": "President Kennedy's niece, Maria Shriver, said it is \"beyond comprehension that this sitting president has sought to rename this great memorial.\"",
            "category": "US News"
        },
        {
            "title": "Trust these numbers? Economists see a lot of flaws in delayed CPI report showing downward inflation",
            "description": "Thursday saw the release of a much lighter-than-expected inflation report for November, and economists are already questioning its significance.",
            "category": "Economic News"
        },
        {
            "title": "November consumer prices rose at a 2.7% annual rate, lower than expected, delayed data shows",
            "description": "Economists polled by Dow Jones expected CPI to have risen 3.1% on an annualized basis.",
            "category": "Economic News"
        },
        {
            "title": "Bank of England cuts interest rates, in welcome Christmas boost for consumers",
            "description": "The Bank of England voted to cut interest rates from 4% to 3.75% in its last monetary policy move of 2025.",
            "category": "Economic News"
        },
        {
            "title": "November's inflation report is the first to be released after the shutdown. Here's what to expect",
            "description": "November's CPI report is expected to show the annual inflation rate at 3.1%, according to economists polled by Dow Jones.",
            "category": "Economic News"
        },
        {
            "title": "Watch Fed Governor Christopher Waller speak on interest rates and the race to succeed Powell",
            "description": "Waller is one of the five finalists considered for to replace Fed Chairman Jerome Powell when his term expires in May. ",
            "category": "Economic News"
        },
        {
            "title": "Hassett says Fed independence is ‘really important’ and chair candidates shouldn’t be disqualified for being Trump’s friend",
            "description": "Hassett declined in a CNBC interview to directly address his own candidacy but said forging consensus is an important part of the job.",
            "category": "Economic News"
        },
        {
            "title": "Lucid's big SUV arrives with high expectations, and big risks",
            "description": "Lucid Motors says its Gravity SUV will sell far better than its Air sedan. But Lucid is losing money, and the rollout has been challenging. ",
            "category": "Technology News"
        },
        {
            "title": "Cramer says Boeing is a buy here — plus, Wells Fargo and bank stocks keep rolling",
            "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
            "category": "Technology News"
        },
        {
            "title": "U.S., Russian officials to meet in Florida for more Ukraine talks",
            "description": "U.S. negotiators are set to meet Russian officials in Florida on Saturday for the latest talks aimed at ending Russia's war in Ukraine.",
            "category": "Politics News"
        },
        {
            "title": "U.S. hits ISIS in Syria with large retaliatory strikes, officials say",
            "description": "President Donald Trump had vowed to retaliate after a suspected ISIS attack killed U.S. personnel last weekend in Syria.",
            "category": "Politics News"
        },
        {
            "title": "European Union approves over $105 billion toward Ukraine aid package for next two years ",
            "description": "European Union countries have agreed to allocate 90 billion euros ($105.5 billion) in aid to Ukraine for 2026 and 2027, the EU Council President said on Friday. ",
            "category": "Politics News"
        }
    ]
}