{
    "date": "2026-01-03",
    "total_items": 25,
    "news": [
        {
            "title": "Trump says U.S. oil companies will invest billions of dollars in Venezuela after Maduro’s overthrow",
            "description": "U.S. oil companies will invest billions of dollars in Venezuela's energy sector after the overthrow of Nicolas Maduro, President Donald Trump said.",
            "category": "Top News"
        },
        {
            "title": "Trump's removal of Maduro prompts questions from Congress",
            "description": "Congressional lawmakers say they were not briefed before President Donald Trump launched a land attack on Venezuela and deposed President Nicolas Maduro.",
            "category": "Top News"
        },
        {
            "title": "After a bruising 2025, the Fed faces another slew of challenges in the year ahead",
            "description": "The central bank heads into 2026 facing a slew of political and policy challenges.",
            "category": "Top News"
        },
        {
            "title": "U.S. indictment against Venezuela President Maduro, wife is unsealed",
            "description": "The indictment was unsealed hours after U.S. forces launched an attack on Venezuela and captured its president Nicolas Maduro and his wife, Cilia Flores.",
            "category": "Top News"
        },
        {
            "title": "Airlines cancel hundreds of Caribbean flights after U.S. attacks on Venezuela",
            "description": "U.S. airlines cancel hundreds of Caribbean flights after U.S. strikes on Venezuela.",
            "category": "Top News"
        },
        {
            "title": "Bank of America expects a boost in dividends in 2026. These stocks have payouts that beat the market ",
            "description": "Bank of America's Savita Subramanian expects stocks’ dividend growth will rise year over year in 2026.",
            "category": "Top News"
        },
        {
            "title": "Watch Trump's full comments following the U.S. strike against Venezuela",
            "description": "President Donald Trump is scheduled to speak Saturday morning following a stunning, large-scale attack on Venezuela overnight. ",
            "category": "World News"
        },
        {
            "title": "Trump orders Chinese-controlled firm to unwind chip asset deal, citing national security risks",
            "description": "A Chinese-controlled company must divest semiconductor assets it bought from Emcore after the White House said the deal could threaten U.S. national security.",
            "category": "World News"
        },
        {
            "title": "China’s ‘Silicon Valley’ is building robots and fortune-telling AI apps at the same time",
            "description": "Hangzhou’s AI ecosystem now spans everything from cutting-edge robotics to experimental apps built by solo founders.",
            "category": "World News"
        },
        {
            "title": "These are the most overbought and oversold stocks in the S&P 500 as 2026 begins",
            "description": "The year just began, but there may be opportunities for investors to catch potential bounces on some stocks — or avoid pullbacks near-term. ",
            "category": "World News"
        },
        {
            "title": "Trump: We are going to run Venezuela until we can do a safe, proper and judicious transition",
            "description": "President Donald Trump addressed the attack on Venezuela from his Mar-a-Lago residence in Palm Beach, Florida.",
            "category": "US News"
        },
        {
            "title": "Economist Mark Zandi sees the Fed surprising with three rate cuts in first half of 2026 ",
            "description": " Markets and Fed officials themselves see only modest easing in the year ahead.",
            "category": "Economic News"
        },
        {
            "title": "Gas prices fall to four-year lows as millions embark on holiday road trips",
            "description": "The average price of unleaded gasoline in the U.S. is at its lowest since 2021, according to AAA.",
            "category": "Economic News"
        },
        {
            "title": "Trust these numbers? Economists see a lot of flaws in delayed CPI report showing downward inflation",
            "description": "Thursday saw the release of a much lighter-than-expected inflation report for November, and economists are already questioning its significance.",
            "category": "Economic News"
        },
        {
            "title": "November consumer prices rose at a 2.7% annual rate, lower than expected, delayed data shows",
            "description": "Economists polled by Dow Jones expected CPI to have risen 3.1% on an annualized basis.",
            "category": "Economic News"
        },
        {
            "title": "Bank of England cuts interest rates, in welcome Christmas boost for consumers",
            "description": "The Bank of England voted to cut interest rates from 4% to 3.75% in its last monetary policy move of 2025.",
            "category": "Economic News"
        },
        {
            "title": "November's inflation report is the first to be released after the shutdown. Here's what to expect",
            "description": "November's CPI report is expected to show the annual inflation rate at 3.1%, according to economists polled by Dow Jones.",
            "category": "Economic News"
        },
        {
            "title": "Week in review: We initiated a position — plus, top gainers and laggards of 2025",
            "description": "Friday marked the end of a lackluster week for stocks and the first trading session of the new year.",
            "category": "Technology News"
        },
        {
            "title": "Anthropic's 'do more with less' bet has kept it at the AI frontier, co-founder Amodei tells CNBC",
            "description": "Daniela Amodei and her brother, Dario Amodei, who is Anthropic's CEO, helped build the very worldview they're now betting against.",
            "category": "Technology News"
        },
        {
            "title": "Ilya Lichtenstein, Bitcoin hacker behind massive crypto theft, credits Trump for early prison release",
            "description": "Ilya Lichtenstein had been sentenced to five years in prison after pleading guilty and admitting to the hack of crypto assets valued in the billions of dollars.",
            "category": "Technology News"
        },
        {
            "title": "Chip stocks rally to start 2026 after third-straight winning year",
            "description": "Investors piled into the winning artificial intelligence-adjacent sector following another big year of gains. ",
            "category": "Technology News"
        },
        {
            "title": "Musk's xAI faces backlash after Grok generates sexualized images of children on X",
            "description": "Users on X raised concerns over explicit content of minors being generated using Musk's Grok tool.",
            "category": "Technology News"
        },
        {
            "title": "Tesla reports 418,227 deliveries for the fourth quarter, down 16%",
            "description": "Tesla's fourth-quarter deliveries report follows a steep rally in the company's stock in the last few months of 2025.",
            "category": "Technology News"
        },
        {
            "title": "'A dangerous ​precedent': World leaders react to the U.S. attack on Venezuela",
            "description": "Russia and Iran broadly condemned the U.S. attack on Venezuela, while other world leaders called for de-escalation and said they are monitoring the situation.",
            "category": "Politics News"
        },
        {
            "title": "U.S. attacks Venezuela, captures Maduro and his wife; AG Bondi says charges include 'Narco-Terrorism'",
            "description": "Maduro and his wife were captured and removed from the country following the operation, Trump said in a statement on Truth Social.",
            "category": "Politics News"
        }
    ]
}