{
    "date": "2025-12-17",
    "total_items": 23,
    "news": [
        {
            "title": "Obamacare subsidies extension to get vote after 4 Republicans buck leadership",
            "description": "Millions of Americans will face much higher health insurance premiums in 2026 if Congress does not extend boosted subsidies for Obamacare plans.",
            "category": "Top News"
        },
        {
            "title": "FCC chief Brendan Carr tells Senate that his agency is 'not formally ... independent' ",
            "description": "FCC chairman Brendan Carr testified to a congressional committee for the first time since ABC suspended Jimmy Kimmel's show following a Carr threat.",
            "category": "Top News"
        },
        {
            "title": "Oracle stock dips 5% on report Blue Owl Capital won't back $10 billion data center",
            "description": "The cloud company later said the project was moving forward and \"on schedule,\" but that Blue Owl was not part of equity talks.",
            "category": "Top News"
        },
        {
            "title": "Stocks fall as tech rout deepens on Oracle concerns: Live updates",
            "description": "The S&P 500 and the Dow Industrials each booked a third consecutive losing session on Tuesday. ",
            "category": "Top News"
        },
        {
            "title": "FBI Deputy Director Dan Bongino plans to step down early next year, MS NOW reports",
            "description": "Bongino had been selected by President Donald Trump for the high-profile law enforcement job despite him having no prior FBI experience. ",
            "category": "Top News"
        },
        {
            "title": "This communication services ETF could be on the verge of a breakout, charts show",
            "description": "A bullish chart pattern has been forming for the State Street Communication Services Select Sector SPDR ETF (XLC).",
            "category": "Top News"
        },
        {
            "title": "Defense stocks rally as Germany set to approve $60 billion defense splurge",
            "description": "German lawmakers are expected to approve proposals for major security procurement. ",
            "category": "World News"
        },
        {
            "title": "Three holds and a cut? Europe's central banks are about to make their final calls of 2025",
            "description": "The European Central Bank, Bank of England, Riksbank and Norges Bank all meet on Thursday.",
            "category": "World News"
        },
        {
            "title": "‘Orwellian’: Ben & Jerry’s founder tells CNBC he’s alarmed by Magnum’s board overhaul",
            "description": "The world's largest standalone ice cream business, Magnum, is only a week old but has already had a lifetime of corporate drama.",
            "category": "World News"
        },
        {
            "title": "The chart that has Michael Burry worried about the stock market",
            "description": "\"The Big Short\" investor pointed to a graphic showing that U.S. households now hold a larger share of their net worth in equities than in real estate.",
            "category": "World News"
        },
        {
            "title": "Amazon says AI chief Rohit Prasad is leaving, Peter DeSantis to lead 'AGI' group",
            "description": "Rohit Prasad, a top Amazon executive overseeing its artificial general intelligence unit, is leaving at the end of this year, the company confirmed.",
            "category": "US News"
        },
        {
            "title": "Medical supply firm Medline jumps more than 25% in debut after biggest IPO of 2025",
            "description": "Medline priced at $29 per share on Tuesday, raising $6.26 billion to cap off a strong year for new listings and bolster optimism about 2026. ",
            "category": "US News"
        },
        {
            "title": "Trump vowed to block tankers carrying Venezuela's oil — nearly a dozen are at sea right now",
            "description": "One of the tankers, Skipper, was seized by American forces in the Caribbean last week in a sharp escalation by the Trump administration.",
            "category": "US News"
        },
        {
            "title": "Watch Fed Governor Christopher Waller speak on interest rates and the race to succeed Powell",
            "description": "Waller is one of the five finalists considered for to replace Fed Chairman Jerome Powell when his term expires in May. ",
            "category": "Economic News"
        },
        {
            "title": "Hassett says Fed independence is ‘really important’ and chair candidates shouldn’t be disqualified for being Trump’s friend",
            "description": "Hassett declined in a CNBC interview to directly address his own candidacy but said forging consensus is an important part of the job.",
            "category": "Economic News"
        },
        {
            "title": "Payrolls rose by 64,000 in November after falling by 105,000 in October, delayed jobs numbers show",
            "description": "Nonfarm payrolls were expected to increase by 45,000 in November as the unemployment rate rose to 4.5%.",
            "category": "Economic News"
        },
        {
            "title": "China lowers anti-dumping tariffs on European pork exporters ",
            "description": "China on Tuesday announced lower duties on pork imports and pig by-products from the European Union. ",
            "category": "Economic News"
        },
        {
            "title": "'Appetizer economy': Food inflation is on restaurant table as diners go smaller with menu choices",
            "description": "Spending on restaurant appetizers is booming during this period of food inflation as consumers find creative ways to cut back even as they continue to dine out.",
            "category": "Economic News"
        },
        {
            "title": "The case for more Fed rate cuts could rest on a 'systematic overcount' of jobs numbers",
            "description": "There are indications that policymakers will be more inclined to cut further if the labor market stays weak. ",
            "category": "Economic News"
        },
        {
            "title": "Unemployment rate rises, Tesla's 2025 turnaround, Siri's AI upgrade and more in Morning Squawk",
            "description": "Here are five key things investors need to know to start the trading day.",
            "category": "Technology News"
        },
        {
            "title": "Apple punted on AI this year. Next year will be critical",
            "description": "Apple this year delayed its big Siri upgrade to 2026. As the company looks ahead, the pressure is on for the iPhone maker to show investors its AI strategy. ",
            "category": "Technology News"
        },
        {
            "title": "CNBC Daily Open: Beauty is in the eye of the U.S. jobs report beholder",
            "description": "Whether you're a bull or a bear, Tuesday's tea leaves will show you what you want to see — but beware confirmation bias.",
            "category": "Technology News"
        },
        {
            "title": "OpenAI in talks with Amazon about investment that could exceed $10 billion",
            "description": "OpenAI is in discussions with Amazon about a potential investment and an agreement to use its artificial intelligence chips, CNBC confirmed. ",
            "category": "Technology News"
        }
    ]
}