{
    "date": "2025-12-08",
    "total_items": 27,
    "news": [
        {
            "title": "Paramount Skydance launches hostile bid for WBD 'to finish what we started,' CEO Ellison tells CNBC",
            "description": "Netflix won a bidding war for the Warner Bros. film studio and HBO Max streaming service, but it doesn't plan to buy WBD's TV networks. ",
            "category": "Top News"
        },
        {
            "title": "Pressure builds on Apple and CEO Tim Cook with holiday executive shake-up",
            "description": "Apple has seen extraordinary turnover in its top ranks over just the past week.",
            "category": "Top News"
        },
        {
            "title": "Former Trump lawyer Alina Habba resigns as New Jersey U.S. Attorney after disqualification",
            "description": "Alina Habba previously served as a defense lawyer for President Donald Trump, before being tapped to become the top federal prosecutor in New Jersey.",
            "category": "Top News"
        },
        {
            "title": "Trump announces $12 billion aid package for farmers caught up in trade war",
            "description": "President Donald Trump has imposed shifting tariff policies on most countries, while pushing to reshape relationships with China and other major trade partners.",
            "category": "Top News"
        },
        {
            "title": "Three more Wall Street firms came out with bullish 2026 outlooks. Here's why they see another upbeat year ahead",
            "description": "The S&P 500 could rise anywhere from another 9% to 18% by the end of 2026, according to three more Wall Street brokerages' latest forecasts. ",
            "category": "Top News"
        },
        {
            "title": "S&P 500 slides as investors tap brakes before Fed decision this week: Live updates",
            "description": "The three major indexes are coming off their second straight winning weeks.",
            "category": "Top News"
        },
        {
            "title": "Powerful 7.6-magnitude earthquake strikes Japan's northeast",
            "description": "A powerful 7.6-magnitude earthquake shook northeastern Japan late on Monday, prompting tsunami warnings and orders for about 90,000 residents to evacuate.",
            "category": "World News"
        },
        {
            "title": "Trump says Zelenskyy 'hasn't read U.S. peace proposal' as tensions mount",
            "description": "Tensions appear to be mounting once again between U.S. President Donald Trump and President Volodymyr Zelenskyy.",
            "category": "World News"
        },
        {
            "title": "European markets fall slightly as markets await Fed decision",
            "description": "European stocks fell slightly on Monday as global investors focused on the U.S. Federal Reserve's monetary policy decision.",
            "category": "World News"
        },
        {
            "title": "How Ray Dalio would play the markets if he was still running Bridgewater",
            "description": "Speaking to CNBC's Dan Murphy, Ray Dalio broke down what his portfolio would look like.",
            "category": "World News"
        },
        {
            "title": "McDonald’s will assess if franchisees are offering value for customers under new standards",
            "description": "McDonald's has leaned into value to appeal to cash-strapped diners who have been visiting its restaurants less frequently.",
            "category": "US News"
        },
        {
            "title": "Trump says Netflix, WBD deal could be 'problem' as son-in-law Kushner backs Paramount bid",
            "description": "Trump's comments came days after Netflix beat out Paramount Skydance's offer for all of WBD, and Comcast's bid for part of the company.",
            "category": "US News"
        },
        {
            "title": "United maintains elite status requirements for 2027, but here's what's changing",
            "description": "Airlines have spent years grappling with having hordes of members in elite frequent flyer programs.",
            "category": "US News"
        },
        {
            "title": "Home sellers are giving up at 'unusually high rate,' says new Realtor report",
            "description": "Sellers are taking their homes off the market at the highest delisting rate since Realtor.com began tracking the seasonal trend in 2022.",
            "category": "US News"
        },
        {
            "title": "Bessent says U.S. will finish the year with 3% GDP growth, sees 'very strong' holiday season",
            "description": "Treasury Secretary Scott Bessent said the economy will end the year on strong footing and said the president was disappointed in economic coverage in the media.",
            "category": "Economic News"
        },
        {
            "title": "Core inflation rate watched by Fed hit 2.8%, delayed September data shows, lower than expected",
            "description": "The delayed core personal consumption expenditures price index for September was expected to show a 2.9% annual increase.",
            "category": "Economic News"
        },
        {
            "title": "Layoff announcements top 1.1 million this year, the most since 2020 pandemic, Challenger says",
            "description": "The firm said layoff plans totaled  71,321 in November, a step down from October but still enough to bring the 2025 total up to 1.17 million.",
            "category": "Economic News"
        },
        {
            "title": "Ukraine, trade, pandas: What China's Xi and France's Macron discussed in Beijing",
            "description": "China said it is open to importing more high-quality goods from France while urging a \"fair, conducive environment\" for Chinese businesses in the European nation. ",
            "category": "Economic News"
        },
        {
            "title": "Bessent says Trump admin will be able to replicate tariffs even if it loses Supreme Court decision",
            "description": "The Treasury secretary cited several sections of 1962 Trade Act that give the president sweeping powers over import duties.",
            "category": "Economic News"
        },
        {
            "title": "November private payrolls unexpectedly fell by 32,000, led by steep small business job cuts, ADP reports",
            "description": "The payrolls decline marked a sharp step down from October, which saw an upwardly revised gain of 47,000 positions.",
            "category": "Economic News"
        },
        {
            "title": "Waymo crosses 450,000 weekly paid rides as Alphabet robotaxi unit widens lead on Tesla",
            "description": "This year, Waymo debuted on freeways in three cities, and started autonomous driving in cities including Miami, Dallas, Houston, San Antonio and Orlando.",
            "category": "Technology News"
        },
        {
            "title": "Apple's chip boss squashes exit rumors, says he's not leaving the company",
            "description": "Bloomberg reported on Saturday that Srouji had told CEO Tim Cook that he was considering leaving.",
            "category": "Technology News"
        },
        {
            "title": "Tiger Global launches new fund eyeing $2.2 billion raise as it takes more disciplined approach",
            "description": "Tiger first invested in OpenAI in 2021 at a valuation of less than $16 billion and in Waymo that same year at $39 billion.",
            "category": "Technology News"
        },
        {
            "title": "S&P 500 win streak, Berkshire's leadership changes, Netflix's regulatory path and more in Morning Squawk",
            "description": "Here are five key things investors need to know to start the trading day.",
            "category": "Technology News"
        },
        {
            "title": "Confluent stock soars 29% as IBM announces $11 billion acquisition deal",
            "description": "IBM will pay $31 per share in cash for all of the issued and outstanding common shares of the Confluent.",
            "category": "Technology News"
        },
        {
            "title": "Supreme Court conservatives poised to back Trump in FTC firing case",
            "description": "The justices heard arguments in the DOJ's appeal of a lower court's decision that Trump exceeded his authority when he moved to dismiss FTC member Rebecca Slaughter. ",
            "category": "Politics News"
        },
        {
            "title": "Treasury Secretary Bessent says he has divested his soybean farm",
            "description": "The New York Times has reported that Secretary Bessent owned as much as $25 million of soybean and corn farmland in North Dakota.",
            "category": "Politics News"
        }
    ]
}