{
    "date": "2025-12-19",
    "total_items": 28,
    "news": [
        {
            "title": "Nine of the largest pharma companies ink deals with Trump to lower drug prices",
            "description": "President Donald Trump has pushed to lower drug prices for Americans, which are on average nearly three times higher than overseas.",
            "category": "Top News"
        },
        {
            "title": "Jeffrey Epstein: Dems say DOJ breaking law with plan to release files over time",
            "description": "President Donald Trump signed the Epstein Files Transparency Act in November.",
            "category": "Top News"
        },
        {
            "title": "NY Fed President Williams says some 'technical factors' distorted November's CPI reading downward",
            "description": "Williams said \"technical factors\" likely distorted November's inflation data, pushing the headline reading lower than it otherwise would have been.",
            "category": "Top News"
        },
        {
            "title": "Oracle stock jumps 8% as cloud provider joins investor group to run TikTok's U.S. business",
            "description": "The new joint venture will prevent TikTok from shutting down in the U.S. due to national security concerns.",
            "category": "Top News"
        },
        {
            "title": "Wall Street heads into the new week with a year-end rally in doubt",
            "description": "December is a seasonally strong period for stocks. But an unusually weak stretch has investors wary. ",
            "category": "Top News"
        },
        {
            "title": "Google's boomerang year: 20% of AI software engineers hired in 2025 were ex-employees",
            "description": "As competition heats up for AI talent, Google turned to hiring more so-called boomerang employees in 2025.",
            "category": "Top News"
        },
        {
            "title": "Nasdaq rises 1% as AI trade tries to end year on high note: Live updates ",
            "description": "The S&P 500 and Dow Jones Industrial Average both snapped their four-day losing streaks in Thursday's regular trading.",
            "category": "World News"
        },
        {
            "title": "European stocks end on record high; Puma shares shed 3% after Nike earnings rattle markets",
            "description": "Share prices in European-listed companies moved into positive territory on Friday after a soft week.",
            "category": "World News"
        },
        {
            "title": "This is how exposed European Big Pharma is to the U.S.",
            "description": "U.S. pricing has been the biggest issue of the year for drugmakers heavily exposed to the U.S. market. ",
            "category": "World News"
        },
        {
            "title": "Check out the winning hedge fund strategies of 2025",
            "description": "As 2025 draws to a close, hedge funds' annual performances face close scrutiny among investors.",
            "category": "World News"
        },
        {
            "title": "Santa Claus rally: What is it and will it occur this year?",
            "description": "As the new year draws closer, eyes are turning to Wall Street to see whether it will pull off the coveted Santa Claus rally.",
            "category": "US News"
        },
        {
            "title": "Trump's name added to Kennedy Center building a day after board votes to rename DC theater",
            "description": "President Kennedy's niece, Maria Shriver, said it is \"beyond comprehension that this sitting president has sought to rename this great memorial.\"",
            "category": "US News"
        },
        {
            "title": "November home sales struggle as supply stalls",
            "description": "Existing home sales edged slightly higher as prices continued to rise and supply dropped. The higher end of the market is performing better.",
            "category": "US News"
        },
        {
            "title": "UnitedHealth Group commits to improvements after independent audit, patient backlash",
            "description": "The company said it has adopted 23 ongoing \"action plans\" to track and implement recommended improvements, all of which will be completed by the end of March.",
            "category": "US News"
        },
        {
            "title": "Trust these numbers? Economists see a lot of flaws in delayed CPI report showing downward inflation",
            "description": "Thursday saw the release of a much lighter-than-expected inflation report for November, and economists are already questioning its significance.",
            "category": "Economic News"
        },
        {
            "title": "November consumer prices rose at a 2.7% annual rate, lower than expected, delayed data shows",
            "description": "Economists polled by Dow Jones expected CPI to have risen 3.1% on an annualized basis.",
            "category": "Economic News"
        },
        {
            "title": "Bank of England cuts interest rates, in welcome Christmas boost for consumers",
            "description": "The Bank of England voted to cut interest rates from 4% to 3.75% in its last monetary policy move of 2025.",
            "category": "Economic News"
        },
        {
            "title": "November's inflation report is the first to be released after the shutdown. Here's what to expect",
            "description": "November's CPI report is expected to show the annual inflation rate at 3.1%, according to economists polled by Dow Jones.",
            "category": "Economic News"
        },
        {
            "title": "Watch Fed Governor Christopher Waller speak on interest rates and the race to succeed Powell",
            "description": "Waller is one of the five finalists considered for to replace Fed Chairman Jerome Powell when his term expires in May. ",
            "category": "Economic News"
        },
        {
            "title": "Hassett says Fed independence is ‘really important’ and chair candidates shouldn’t be disqualified for being Trump’s friend",
            "description": "Hassett declined in a CNBC interview to directly address his own candidacy but said forging consensus is an important part of the job.",
            "category": "Economic News"
        },
        {
            "title": "Cramer says Boeing is a buy here — plus, Wells Fargo and bank stocks keep rolling",
            "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
            "category": "Technology News"
        },
        {
            "title": "Palo Alto Networks announces multibillion-dollar deal with Google Cloud",
            "description": "The agreement is an expansion of the companies' existing strategic partnership.",
            "category": "Technology News"
        },
        {
            "title": "Inside Intel’s new Arizona fab, where the chipmaker’s fate hangs in the balance",
            "description": "At Intel’s new fab in Arizona, 18A is in high-volume production. With no major outside customers and a 10% government stake, is it enough to save the chipmaker?",
            "category": "Technology News"
        },
        {
            "title": "Quad witching, Nike slides, weed rules and more in Morning Squawk",
            "description": "Here are five key things investors need to know to start the trading day.",
            "category": "Technology News"
        },
        {
            "title": "European Union approves over $105 billion toward Ukraine aid package for next two years ",
            "description": "European Union countries have agreed to allocate 90 billion euros ($105.5 billion) in aid to Ukraine for 2026 and 2027, the EU Council President said on Friday. ",
            "category": "Politics News"
        },
        {
            "title": "Brown and MIT prof shooter suspect Neves Valente is found dead, authorities say",
            "description": "The suspected killer, Claudio Manuel Neves Valente, 48, was a graduate students in physics at Brown University in the early 2000s.",
            "category": "Politics News"
        },
        {
            "title": "Congressional stock trading ban bill to get a vote in new year, House Republicans say",
            "description": "Democrats and Republicans remain split on whether a stock trading ban should extend to President Donald Trump",
            "category": "Politics News"
        },
        {
            "title": "House passes bill to ease permits for building out AI infrastructure",
            "description": "The SPEED Act now heads to the Senate, which is in the early stages of its own permitting reform talks. ",
            "category": "Politics News"
        }
    ]
}