{
    "date": "2025-12-16",
    "total_items": 23,
    "news": [
        {
            "title": "What Trump's reclassification of pot and CBD could mean for seniors, research and stocks",
            "description": "Reclassification to a Schedule III drug and possible Medicare coverage for pot could unlock new investment from pharmaceutical companies.",
            "category": "Top News"
        },
        {
            "title": "Key ACA tax credits likely to expire after House speaker blocks vote",
            "description": "Democrats in the House back a last-ditch effort to extend Obamacare subsidies, which relies on a tactic recently used for the Jeffrey Epstein files bill.",
            "category": "Top News"
        },
        {
            "title": "Payrolls rose by 64,000 in November after falling by 105,000 in October, delayed jobs numbers show",
            "description": "Nonfarm payrolls were expected to increase by 45,000 in November as the unemployment rate rose to 4.5%.",
            "category": "Top News"
        },
        {
            "title": "U.S. crude oil drops below $55 a barrel, hits lowest level since early 2021",
            "description": "The oil market is under pressure as OPEC+ members have rapidly ramped up production and the U.S. pushes Ukraine to accept a peace agreement with Russia. ",
            "category": "Top News"
        },
        {
            "title": "Nasdaq moves to make trading nearly 24 hours. Why some on Wall Street say that's a bad idea",
            "description": "Critics argue that formalizing nearly nonstop trading could worsen some of the very problems that plague the structure of equity markets today.",
            "category": "Top News"
        },
        {
            "title": "This chip play’s strong 2025 run could hit a speed bump as earnings loom, charts show",
            "description": "Micron is toting a sizable gain on a year-to-date basis as its earnings release approaches, but that momentum may not last.",
            "category": "Top News"
        },
        {
            "title": "Vibe coding startup Lovable's latest funding round values it at $6.6 billion, sources say",
            "description": "Accel is participating in the round, the sources said, adding it would more than triple the valuation it achieved with its previous round in July.",
            "category": "World News"
        },
        {
            "title": "S&P 500 falls after delayed jobs figures paint weak picture of economy: Live updates",
            "description": "The three benchmark U.S. indexes closed lower on Monday, pressured by losses in key artificial intelligence names. ",
            "category": "World News"
        },
        {
            "title": "Here are Bank of America’s top European auto picks for 2026",
            "description": "BofA's European automotive equity research head Horst Schneider unveiled key sector picks.",
            "category": "World News"
        },
        {
            "title": "Top Trump aide Susie Wiles says he has 'alcoholic's personality,' sought 'retribution' against NY AG Letitia James",
            "description": "Wiles, in the rare, candid interviews, described Trump's \"reciprocal\" tariff policy as \"so much thinking out loud.\"",
            "category": "US News"
        },
        {
            "title": "Bill to ease Big Tech project permits advances in House",
            "description": "Backers say the SPEED Act is crucial to helping the U.S. beat out China and other global competitors for leadership in AI.",
            "category": "US News"
        },
        {
            "title": "Instagram TV app coming to Amazon Fire streaming device",
            "description": "Meta said Tuesday that it will begin testing its Instagram for TV app in the U.S. via Amazon's Fire TV streaming devices.",
            "category": "US News"
        },
        {
            "title": "Pfizer’s modest 2026 outlook shows its big investments will take time to pay off",
            "description": "Pfizer has pursued deals of all sizes to build new revenue streams, but the outlook underscores that those investments are still some distance from paying off. ",
            "category": "US News"
        },
        {
            "title": "Hassett says Fed independence is ‘really important’ and chair candidates shouldn’t be disqualified for being Trump’s friend",
            "description": "Hassett declined in a CNBC interview to directly address his own candidacy but said forging consensus is an important part of the job.",
            "category": "Economic News"
        },
        {
            "title": "China lowers anti-dumping tariffs on European pork exporters ",
            "description": "China on Tuesday announced lower duties on pork imports and pig by-products from the European Union. ",
            "category": "Economic News"
        },
        {
            "title": "'Appetizer economy': Food inflation is on restaurant table as diners go smaller with menu choices",
            "description": "Spending on restaurant appetizers is booming during this period of food inflation as consumers find creative ways to cut back even as they continue to dine out.",
            "category": "Economic News"
        },
        {
            "title": "The case for more Fed rate cuts could rest on a 'systematic overcount' of jobs numbers",
            "description": "There are indications that policymakers will be more inclined to cut further if the labor market stays weak. ",
            "category": "Economic News"
        },
        {
            "title": "Trump administration's new quarters feature pilgrims, ditching civil rights theme",
            "description": "Special quarter-dollar coin designs for the U.S.' 250th birthday feature pilgrims and former presidents rather than previously floated civil rights themes.",
            "category": "Economic News"
        },
        {
            "title": "Jim Cramer says Amazon is a buy on 2025 underperformance for this key reason",
            "description": "Jim Cramer says investors better act fast while Amazon stock is still on the sale rack.",
            "category": "Technology News"
        },
        {
            "title": "Databricks raises capital at $134 billion valuation in latest funding round",
            "description": "Companies such as Databricks, SpaceX and OpenAI have reached mega valuations while staying private for longer.",
            "category": "Technology News"
        },
        {
            "title": "Jobs data, Tesla's rally, tariff revenue hits $200 billion and more in Morning Squawk",
            "description": "Here are five key things investors need to know to start the trading day.",
            "category": "Technology News"
        },
        {
            "title": "Korea Zinc sinks 14% as largest shareholder group challenges U.S.-backed plans for Tennessee smelter",
            "description": "Korea Zinc's largest shareholder group is reportedly opposing plans to create a U.S.-backed joint venture that will see a dilution of the group's stake in the company.",
            "category": "Politics News"
        },
        {
            "title": "Trump sues BBC for $10 billion, claims defamation from Panorama documentary",
            "description": "The lawsuit by President Trump against the BBC accuses the British broadcaster of trying to influence the outcome of his 2024 election against Kamala Harris.",
            "category": "Politics News"
        }
    ]
}