{
    "date": "2025-12-14",
    "total_items": 26,
    "news": [
        {
            "title": "Trump wants the U.S. shipbuilding industry to be great again. Here's what it will take, and what's at stake",
            "description": "President Donald Trump is promising a U.S. shipbuilding renaissance to rival China, but it will not happen overnight and will require allies.",
            "category": "Top News"
        },
        {
            "title": "Person of interest detained in Brown University shooting that killed 2 and wounded 9",
            "description": "A person of interest was in custody Sunday after a shooting during final exams at Brown University that killed two students and wounded nine others.",
            "category": "Top News"
        },
        {
            "title": "End of 'The Berkshire Way'? Combs' departure isn't only big change as Buffett transition nears ",
            "description": "There were several additional personnel changes in Monday's three-page news release that signal the company is moving toward a more conventional structure.",
            "category": "Top News"
        },
        {
            "title": "Gunmen kill 16 at Australia's Bondi Beach Jewish holiday event",
            "description": "Gunmen opened fire at a Jewish holiday celebration at Sydney's Bondi Beach on Sunday, killing at least 16 people in a targeted antisemitic attack.",
            "category": "Top News"
        },
        {
            "title": "ServiceNow in talks to acquire cybersecurity startup Armis in potential $7 billion deal, Bloomberg reports",
            "description": "Software company ServiceNow is in advanced discussions to acquire Armis, a cybersecurity startup last valued at $6.1 billion. ",
            "category": "Top News"
        },
        {
            "title": "Bank of America recommends these stocks because of their link to trends like the high-end consumer",
            "description": "Bank of America says stocks like Nvidia have more room to run.",
            "category": "Top News"
        },
        {
            "title": "Global week ahead: Europe under fire",
            "description": "European leaders prepare to meet after U.S. President Trump calls them \"weak,\" at a critical time for Ukraine peace deal negotiations. ",
            "category": "World News"
        },
        {
            "title": "Ukraine's Zelenskyy ditches ambition to join NATO ahead of peace talks",
            "description": "Ukraine has relinquished its ambition of joining the NATO military alliance in exchange for Western security guarantees, President Volodymyr Zelenskyy said.",
            "category": "World News"
        },
        {
            "title": "Lukashenko frees Nobel winner Bialiatski and key Belarus opposition figures in deal with the U.S.",
            "description": "Belarusian President Alexander Lukashenko freed 123 prisoners on Saturday after two days of talks with an envoy for U.S. President Donald Trump.",
            "category": "World News"
        },
        {
            "title": "TSA is giving airline passenger data to ICE for deportation push: NYT",
            "description": "The program led to the arrest in Boston of Any Lucía López Belloza, a college student who was deported to Honduras, the report said.",
            "category": "US News"
        },
        {
            "title": "Oracle says there have been 'no delays' in OpenAI arrangement after stock slide",
            "description": "Oracle pushed back against a report that said the company will complete data centers for OpenAI, one of its major customers, in 2028, rather than 2027.",
            "category": "US News"
        },
        {
            "title": "A big week of economic data is next for a stock market in the throes of a major rotation ",
            "description": "Any positive surprise in the jobs or inflation data next week could open the door for stock buyers just ahead of the holidays. ",
            "category": "US News"
        },
        {
            "title": "AI order from Trump might be ‘illegal,’ Democrats and consumer advocacy groups claim",
            "description": "President Donald Trump's executive order on a national artificial intelligence framework threatens funding for states that pursue AI laws deemed \"onerous.\"",
            "category": "US News"
        },
        {
            "title": "Trump sued by preservation group seeking to halt White House ballroom construction",
            "description": "The lawsuit argues that President Trump was legally required to get federal approvals before demolishing the historic East Wing of the White House.",
            "category": "US News"
        },
        {
            "title": "'Appetizer economy': Food inflation is on restaurant table as diners go smaller with menu choices",
            "description": "Spending on restaurant appetizers is booming during this period of food inflation as consumers find creative ways to cut back even as they continue to dine out.",
            "category": "Economic News"
        },
        {
            "title": "The case for more Fed rate cuts could rest on a 'systematic overcount' of jobs numbers",
            "description": "There are indications that policymakers will be more inclined to cut further if the labor market stays weak. ",
            "category": "Economic News"
        },
        {
            "title": "Trump administration's new quarters feature pilgrims, ditching civil rights theme",
            "description": "Special quarter-dollar coin designs for the U.S.' 250th birthday feature pilgrims and former presidents rather than previously floated civil rights themes.",
            "category": "Economic News"
        },
        {
            "title": "U.S. has to stop taking in 'below-average' immigrants who won't help economy, says Lutnick",
            "description": "The White House is rolling out its gold card visa.",
            "category": "Economic News"
        },
        {
            "title": "Bessent to propose major overhaul of regulatory body created from financial crisis",
            "description": "In a letter set to be released Thursday, Bessent will recommend changing the approach of the Financial Stability Oversight Council. ",
            "category": "Economic News"
        },
        {
            "title": "Bessent says U.S. will finish the year with 3% GDP growth, sees 'very strong' holiday season",
            "description": "Treasury Secretary Scott Bessent said the economy will end the year on strong footing and said the president was disappointed in economic coverage in the media.",
            "category": "Economic News"
        },
        {
            "title": "Here are 4 major moments that drove the stock market last week",
            "description": "The S&P 500 ran into a brick wall Friday and finished the week lower, just one day after closing at a record high.",
            "category": "Technology News"
        },
        {
            "title": "Coinbase to soon unveil prediction markets powered by Kalshi, source says",
            "description": "A source told CNBC that Coinbase will soon unveil prediction markets, powered by Kalshi, underscoring the firm's push to fulfill its \"everything exchange\" vision.",
            "category": "Technology News"
        },
        {
            "title": "Broadcom tumbles 11% despite blockbuster earnings as 'AI angst' weighs on Oracle, Nvidia",
            "description": "Even with better-than-expected earnings and revenue, Broadcom slid on Friday as investors  continued to grow concerned about the AI trade.",
            "category": "Technology News"
        },
        {
            "title": "Judge says Comey evidence was wrongfully retained, creating hurdle for new charges",
            "description": "Prosecutors must return evidence seized from a key figure in the dismissed criminal case against former FBI Director James Comey, a federal judge has ruled.",
            "category": "Politics News"
        },
        {
            "title": "Two U.S. soldiers and an interpreter killed in suspected Islamic State attack in Syria",
            "description": "Two Army soldiers and a civilian interpreter were killed by a suspected Islamic State attacker who targeted a convoy of U.S. and Syrian forces.",
            "category": "Politics News"
        },
        {
            "title": "U.S. Veterans Affairs agency plans as many as 35,000 health-care job cuts this month, Washington Post reports",
            "description": "The Department of Veterans Affairs plans to eliminate as many as 35,000 health-care positions this month, the Washington Post reported, citing an internal memo.",
            "category": "Politics News"
        }
    ]
}