{
    "date": "2025-12-23",
    "total_items": 29,
    "news": [
        {
            "title": "Fed chair candidate Hassett says U.S. is way behind the curve on lowering interest rates",
            "description": "Hassett said the artificial intelligence boom is boosting economic growth while simultaneously putting downward pressure on inflation. ",
            "category": "Top News"
        },
        {
            "title": "Citadel to return $5 billion in profit to investors, source says",
            "description": "The firm's flagship multistrategy fund, known as Wellington, gained 9.3% in the year through last week, the person said.",
            "category": "Top News"
        },
        {
            "title": "Trump administration to start seizing pay of defaulted student loan borrowers in January ",
            "description": "The Trump administration will start garnishing the wages of student loan borrowers in default in early January. ",
            "category": "Top News"
        },
        {
            "title": "Epstein files: Latest batch from DOJ includes a personal letter, emails and heavily redacted documents",
            "description": "The release comes amid intense scrutiny from congressional lawmakers and victims over the DOJ's handling of the Epstein files.",
            "category": "Top News"
        },
        {
            "title": "Nvidia and this athleisure maker saw big insider selling last week",
            "description": "A CNBC Pro data analysis shows insiders sold many shares of Nvidia, Lululemon Athletica, Las Vegas Sands, Gap and other stocks last week",
            "category": "Top News"
        },
        {
            "title": "Southwest's profits are down 42% this year but it's the top U.S. airline stock",
            "description": "Southwest's stock has gained nearly 24% so far this year, more than any other airline.",
            "category": "Top News"
        },
        {
            "title": "The next AI pivot will be toward efficiency and lowering costs, ex-Facebook privacy chief says",
            "description": "Former Facebook privacy chief Chris Kelly said that AI companies will focus on creating efficiencies for training models. ",
            "category": "World News"
        },
        {
            "title": "U.S. pushes additional tariffs on Chinese chips to June 2027",
            "description": "As part of an investigation that kicked off a year ago, the agency found that China is engaging in unfair trade practices in the industry. ",
            "category": "World News"
        },
        {
            "title": "U.S. economy grows by 4.3% in third quarter, much more than expected, delayed report shows",
            "description": "The U.S. economy grew at a much greater-than-expected pace in the third quarter, boosted by strong consumer spending, a delayed report released Tuesday showed. ",
            "category": "World News"
        },
        {
            "title": "Gold and silver reach fresh highs for second day running — and could keep climbing",
            "description": "David Neuhauser, CIO at Livermore Partners, told CNBC's \"Access Middle East\" that gold has more room to run. ",
            "category": "World News"
        },
        {
            "title": "‘No doubt’ U.S. economy is slowing, Invesco says, tipping Europe to outperform",
            "description": "Invesco's Ben Gutteridge sees a mid-cycle slowdown in the U.S., with Europe poised to outperform in 2026.",
            "category": "World News"
        },
        {
            "title": "Inside the rise of Gen Z’s nostalgia-fueled plush-toy craze as they delay adulthood",
            "description": "\"The economy, the wars, everything is really depressing and serious, whereas toys just bring a little bit of joy back into life,\" one toy director said. ",
            "category": "World News"
        },
        {
            "title": "Here's how AI could influence the Fed's economic outlook",
            "description": "Artificial intelligence could produce faster gains in worker productivity, altering the U.S. labor market and the Federal Reserve's economic outlook. ",
            "category": "US News"
        },
        {
            "title": "EV realism is here. How automakers react in 2026 will be telling",
            "description": "Detroit automakers are refocusing on large gas-guzzling trucks and SUVs, and many have admitted that policies, not consumers, were driving the charge for EVs.",
            "category": "US News"
        },
        {
            "title": "Hanwha Ocean shares jump 10% after Trump says South Korean firm to build warships for U.S. Navy",
            "description": "Trump said that the frigates will be built at the Philadelphia shipyards, which Hanwha had invested $5 billion into.",
            "category": "US News"
        },
        {
            "title": "Gas prices fall to four-year lows as millions embark on holiday road trips",
            "description": "The average price of unleaded gasoline in the U.S. is at its lowest since 2021, according to AAA.",
            "category": "Economic News"
        },
        {
            "title": "Trust these numbers? Economists see a lot of flaws in delayed CPI report showing downward inflation",
            "description": "Thursday saw the release of a much lighter-than-expected inflation report for November, and economists are already questioning its significance.",
            "category": "Economic News"
        },
        {
            "title": "November consumer prices rose at a 2.7% annual rate, lower than expected, delayed data shows",
            "description": "Economists polled by Dow Jones expected CPI to have risen 3.1% on an annualized basis.",
            "category": "Economic News"
        },
        {
            "title": "Bank of England cuts interest rates, in welcome Christmas boost for consumers",
            "description": "The Bank of England voted to cut interest rates from 4% to 3.75% in its last monetary policy move of 2025.",
            "category": "Economic News"
        },
        {
            "title": "November's inflation report is the first to be released after the shutdown. Here's what to expect",
            "description": "November's CPI report is expected to show the annual inflation rate at 3.1%, according to economists polled by Dow Jones.",
            "category": "Economic News"
        },
        {
            "title": "Watch Fed Governor Christopher Waller speak on interest rates and the race to succeed Powell",
            "description": "Waller is one of the five finalists considered for to replace Fed Chairman Jerome Powell when his term expires in May. ",
            "category": "Economic News"
        },
        {
            "title": "Why we put Alphabet back in the Bullpen — plus, Cramer's case for Nvidia in 2026",
            "description": "The Investing Club holds its \"Morning Meeting\" every weekday at 10:20 a.m. ET.",
            "category": "Technology News"
        },
        {
            "title": "ServiceNow's deal blitz gives it an 'AI control tower,' CEO McDermott tells CNBC",
            "description": "The enterprise software company said the deal will bolster its cybersecurity capabilities in the age of artificial intelligence. ",
            "category": "Technology News"
        },
        {
            "title": "Novo Nordisk's new obesity pill, Alphabet's data center deal, the end of EV euphoria and more in Morning Squawk",
            "description": "Here are five key things investors need to know to start the trading day.",
            "category": "Technology News"
        },
        {
            "title": "Greenland PM rebukes Trump special envoy overture",
            "description": "President Donald Trump on Sunday appointed Louisiana Gov. Jeff Landry as a \"special envoy\" to Greenland. ",
            "category": "Politics News"
        },
        {
            "title": "Crypto laments loss of key ally on Capitol Hill after Lummis announces retirement",
            "description": "Sen. Cynthia Lummis’ retirement tees up a Republican primary in Wyoming, where the victor will be heavily favored in November. ",
            "category": "Politics News"
        },
        {
            "title": "Epstein Files: Schumer to force Senate vote on suing DOJ over partial release",
            "description": "President Donald Trump signed a law compelling the full release of the Jeffrey Epstein files. But the DOJ has released just a fraction.",
            "category": "Politics News"
        },
        {
            "title": "Epstein files: DOJ restores image showing Trump after backlash",
            "description": "The Department of Justice faces criticism for not releasing all of the Epstein files on Friday, despite a law signed by President Donald Trump requiring it.",
            "category": "Politics News"
        },
        {
            "title": "Kremlin says peace prospects not improved by Europe, Ukraine changes to U.S. proposals",
            "description": "European and Ukrainian negotiators have been discussing changes to a U.S. set of proposals for an agreement to end the nearly four-year-old war.",
            "category": "Politics News"
        }
    ]
}