{
    "date": "2025-12-10",
    "total_items": 26,
    "news": [
        {
            "title": "Divided Fed approves third rate cut this year, sees slower pace ahead",
            "description": "The Federal Reserve on Wednesday made its final final interest rate move of the year. ",
            "category": "Top News"
        },
        {
            "title": "The Fed is the most divided it's been in more than a decade",
            "description": "Three members of the Federal Open Market Committee didn't agree with the central bank's quarter percentage point cut on Wednesday.",
            "category": "Top News"
        },
        {
            "title": "Dow jumps 380 points after Fed rate cut as traders bet more easing is coming next year: Live updates",
            "description": "The Dow Jones Industrial Average continued to rise on Wednesday after the Federal Reserve's latest interest rate decision.",
            "category": "Top News"
        },
        {
            "title": "U.S. seizes oil tanker off the coast of Venezuela: Report",
            "description": "The White House has undertaken a large military buildup in the Caribbean and launched deadly strikes against boats that it claims were trafficking drugs.",
            "category": "Top News"
        },
        {
            "title": "Homeland Security Dept. buying Boeing 737s for ICE deportations",
            "description": "The Trump administration has aimed to deport 1 million immigrants from the United States in President Donald Trump's first year back in the White House.",
            "category": "Top News"
        },
        {
            "title": "What Wall Street analysts expect from Oracle earnings due after Wednesday's close ",
            "description": "JPMorgan, which has a neutral rating on Oracle, believes management may provide a diversified list of reputable customers that could ease pressure on the stock.",
            "category": "Top News"
        },
        {
            "title": "Swiss government says new 15% U.S. tariff ceiling retroactive to mid-November",
            "description": "Switzerland agreed to reduce tariffs on imports from the United States of fish, seafood, and some agricultural products under a trade deal announced last month.",
            "category": "World News"
        },
        {
            "title": "U.S. to mandate checks of some tourists' social media history from past 5 years ",
            "description": "Tourists from countries including Britain, Japan, France, and Australia will now be expected to provide their social media history to visit to the U.S. ",
            "category": "World News"
        },
        {
            "title": "Trump admin touts pulling nearly 10,000 truckers off road for failing English tests",
            "description": "The Trump administration has drawn links between the surge in immigration under former President Joe Biden and road safety.",
            "category": "US News"
        },
        {
            "title": "Here's what changed in the new Fed statement",
            "description": "This is a comparison of Wednesday's Federal Open Market Committee statement with the one issued after the Fed's previous policymaking meeting in October.",
            "category": "US News"
        },
        {
            "title": "Southwest CEO says airline 'actively pursuing' network of airport lounges",
            "description": "Southwest's CEO said the carrier is weighing a network of airport lounges",
            "category": "US News"
        },
        {
            "title": "Bessent says U.S. will finish the year with 3% GDP growth, sees 'very strong' holiday season",
            "description": "Treasury Secretary Scott Bessent said the economy will end the year on strong footing and said the president was disappointed in economic coverage in the media.",
            "category": "Economic News"
        },
        {
            "title": "Core inflation rate watched by Fed hit 2.8%, delayed September data shows, lower than expected",
            "description": "The delayed core personal consumption expenditures price index for September was expected to show a 2.9% annual increase.",
            "category": "Economic News"
        },
        {
            "title": "Layoff announcements top 1.1 million this year, the most since 2020 pandemic, Challenger says",
            "description": "The firm said layoff plans totaled  71,321 in November, a step down from October but still enough to bring the 2025 total up to 1.17 million.",
            "category": "Economic News"
        },
        {
            "title": "Ukraine, trade, pandas: What China's Xi and France's Macron discussed in Beijing",
            "description": "China said it is open to importing more high-quality goods from France while urging a \"fair, conducive environment\" for Chinese businesses in the European nation. ",
            "category": "Economic News"
        },
        {
            "title": "Bessent says Trump admin will be able to replicate tariffs even if it loses Supreme Court decision",
            "description": "The Treasury secretary cited several sections of 1962 Trade Act that give the president sweeping powers over import duties.",
            "category": "Economic News"
        },
        {
            "title": "November private payrolls unexpectedly fell by 32,000, led by steep small business job cuts, ADP reports",
            "description": "The payrolls decline marked a sharp step down from October, which saw an upwardly revised gain of 47,000 positions.",
            "category": "Economic News"
        },
        {
            "title": "Oracle set to report quarterly results after the bell",
            "description": "Oracle's hefty infrastructure costs and rising debt load have weighed on the stock in the past few months. ",
            "category": "Technology News"
        },
        {
            "title": "Nvidia responds to report that China's DeepSeek is using its banned Blackwell AI chips",
            "description": "The U.S. has blocked the export of Nvidia's Blackwell chips to China in an effort to stay ahead in the AI race.",
            "category": "Technology News"
        },
        {
            "title": "‘Greetings, earthlings’: Nvidia-backed Starcloud trains first AI model in space as orbital data center race heats up",
            "description": "The company's Starcloud-1 satellite is running Gemma, an open model from Google, marking the first time in history that an LLM has been trained in outer space. ",
            "category": "Technology News"
        },
        {
            "title": "Former GitLab CEO raises money for Kilo to compete in crowded AI coding market",
            "description": "Kilo Code, which makes a vibe coding extension, was founded by former GitLab CEO Sid Sijbrandij. ",
            "category": "Technology News"
        },
        {
            "title": "The Fed meeting, pressure on Oracle, Target's fashion-forward renovation and more in Morning Squawk",
            "description": "Here are five key things investors need to know to start the trading day.",
            "category": "Technology News"
        },
        {
            "title": "Australia is trying to enforce the first teen social media ban. Governments worldwide are watching.",
            "description": "Australia has enacted the world's first ban on social media usage for users under the age of 16, in a move expected to be monitored by global lawmakers.  ",
            "category": "Technology News"
        },
        {
            "title": "Trump says he 'heard' Biden Fed appointments were signed by autopen, tells aide to investigate",
            "description": "Trump's autopen comments came during a speech in Pennsylvania about the economy, aimed at countering Democrats' messaging about the U.S. affordability crisis.",
            "category": "Politics News"
        },
        {
            "title": "Watch: Trump delivers speech on the economy in Pennsylvania as cost concerns grow ",
            "description": "The Pennsylvania trip marks a return to the sort of voter outreach that defined Trump's political campaigns, but has grown rarer during his second term so far.",
            "category": "Politics News"
        },
        {
            "title": "Trump trade rep changes China soybean purchase timeline, cites 'discrepancy'",
            "description": "China for months earlier this year had boycotted purchasing soybeans from U.S. farms because of a trade war began by President Donald Trump.",
            "category": "Politics News"
        }
    ]
}