{
    "date": "2025-12-13",
    "total_items": 27,
    "news": [
        {
            "title": "End of 'The Berkshire Way'? Combs' departure isn't only big change as Buffett transition nears ",
            "description": "There were several additional personnel changes in Monday's three-page news release that signal the company is moving toward a more conventional structure.",
            "category": "Top News"
        },
        {
            "title": "Trump says Kevin Warsh is at top of Fed chair candidate list, president should be consulted on rates",
            "description": "Trump said Friday that Kevin Warsh has moved to the top of his list as the next Federal Reserve chair, though others remain in contention.",
            "category": "Top News"
        },
        {
            "title": "Financial fraud cost older adults up to $81.5 billion in 2024, FTC estimates — more are losing at least $100,000",
            "description": "From 2020 to 2024, the 60-plus age group's reported losses have jumped 300% to $2.4 billion from $600 million, according to the Federal Trade Commission.",
            "category": "Top News"
        },
        {
            "title": "Trump says 'no big deal' after Jeffrey Epstein photos showing him released",
            "description": "Democrats on the House Oversight Committee released the photos to pressure the Trump administration to release files about Jeffrey Epstein.",
            "category": "Top News"
        },
        {
            "title": "Goldman Sachs makes big bet on ETFs specializing in downside protection ",
            "description": "Goldman Sachs Asset Management is making a big bet on defined outcome exchange-traded funds — which use options to help protect against market losses.",
            "category": "Top News"
        },
        {
            "title": "Wall Street's most overbought stocks this week don't include any tech names",
            "description": "Reflecting this week's market rotation toward value stocks, Buffalo, N.Y.-based M&T Bank was one of Wall Street's most overbought companies this week.",
            "category": "Top News"
        },
        {
            "title": "Broadcom tumbles 11% despite blockbuster earnings as 'AI angst' weighs on Oracle, Nvidia",
            "description": "Even with better-than-expected earnings and revenue, Broadcom slid on Friday as investors  continued to grow concerned about the AI trade.",
            "category": "World News"
        },
        {
            "title": "Lukashenko frees Nobel winner Bialiatski and key Belarus opposition figures in deal with the U.S.",
            "description": "Belarusian President Alexander Lukashenko freed 123 prisoners on Saturday after two days of talks with an envoy for U.S. President Donald Trump.",
            "category": "World News"
        },
        {
            "title": "YouTube’s CEO limits his kids’ social media use — other tech bosses do the same ",
            "description": "YouTube's CEO Neal Mohan joins other tech bosses from Bill Gates to Mark Cuban who restrict their children's social media and smartphone use. ",
            "category": "World News"
        },
        {
            "title": "Trump expected to sign executive order to reclassify marijuana as soon as Monday, source tells CNBC; pot stocks surge",
            "description": "Trump expected to sign executive order to reclassify marijuana as soon as Monday.",
            "category": "World News"
        },
        {
            "title": "Todd Combs' stellar 15-year career at Berkshire started with an unsolicited letter to Charlie Munger",
            "description": "Combs, 54, first caught the attention of Buffett's late partner Charlie Munger, who recounted receiving an unsolicited letter from the hedge fund manager.",
            "category": "World News"
        },
        {
            "title": "TSA is giving airline passenger data to ICE for deportation push: NYT",
            "description": "The program led to the arrest in Boston of Any Lucía López Belloza, a college student who was deported to Honduras, the report said.",
            "category": "US News"
        },
        {
            "title": "Oracle says there have been 'no delays' in OpenAI arrangement after stock slide",
            "description": "Oracle pushed back against a report that said the company will complete data centers for OpenAI, one of its major customers, in 2028, rather than 2027.",
            "category": "US News"
        },
        {
            "title": "A big week of economic data is next for a stock market in the throes of a major rotation ",
            "description": "Any positive surprise in the jobs or inflation data next week could open the door for stock buyers just ahead of the holidays. ",
            "category": "US News"
        },
        {
            "title": "AI order from Trump might be ‘illegal,’ Democrats and consumer advocacy groups claim",
            "description": "President Donald Trump's executive order on a national artificial intelligence framework threatens funding for states that pursue AI laws deemed \"onerous.\"",
            "category": "US News"
        },
        {
            "title": "Trump sued by preservation group seeking to halt White House ballroom construction",
            "description": "The lawsuit argues that President Trump was legally required to get federal approvals before demolishing the historic East Wing of the White House.",
            "category": "US News"
        },
        {
            "title": "'Appetizer economy': Food inflation is on restaurant table as diners go smaller with menu choices",
            "description": "Spending on restaurant appetizers is booming during this period of food inflation as consumers find creative ways to cut back even as they continue to dine out.",
            "category": "Economic News"
        },
        {
            "title": "The case for more Fed rate cuts could rest on a 'systematic overcount' of jobs numbers",
            "description": "There are indications that policymakers will be more inclined to cut further if the labor market stays weak. ",
            "category": "Economic News"
        },
        {
            "title": "Trump administration's new quarters feature pilgrims, ditching civil rights theme",
            "description": "Special quarter-dollar coin designs for the U.S.' 250th birthday feature pilgrims and former presidents rather than previously floated civil rights themes.",
            "category": "Economic News"
        },
        {
            "title": "U.S. has to stop taking in 'below-average' immigrants who won't help economy, says Lutnick",
            "description": "The White House is rolling out its gold card visa.",
            "category": "Economic News"
        },
        {
            "title": "Bessent to propose major overhaul of regulatory body created from financial crisis",
            "description": "In a letter set to be released Thursday, Bessent will recommend changing the approach of the Financial Stability Oversight Council. ",
            "category": "Economic News"
        },
        {
            "title": "Bessent says U.S. will finish the year with 3% GDP growth, sees 'very strong' holiday season",
            "description": "Treasury Secretary Scott Bessent said the economy will end the year on strong footing and said the president was disappointed in economic coverage in the media.",
            "category": "Economic News"
        },
        {
            "title": "Coinbase to soon unveil prediction markets powered by Kalshi, source says",
            "description": "A source told CNBC that Coinbase will soon unveil prediction markets, powered by Kalshi, underscoring the firm's push to fulfill its \"everything exchange\" vision.",
            "category": "Technology News"
        },
        {
            "title": "Rivian's AI, autonomy impress Wall Street, but EV and capital concerns remain",
            "description": "Rivian impressed Wall Street with its plans for AI and automation, but significant challenges involving demand and capital remain for the EV maker.",
            "category": "Technology News"
        },
        {
            "title": "Jim Cramer says buy the sharp decline in Broadcom. Here's why",
            "description": "CNBC's Jim Cramer told investors on Friday to buy the sharp, post-earnings sell-off in Broadcom shares.",
            "category": "Technology News"
        },
        {
            "title": "Two U.S. soldiers and a civilian interpreter killed in suspected Islamic State attack in Syria",
            "description": "Two Army soldiers and a civilian interpreter were killed by a suspected Islamic State attacker who targeted a convoy of U.S. and Syrian forces.",
            "category": "Politics News"
        },
        {
            "title": "U.S. Veterans Affairs agency plans as many as 35,000 health-care job cuts this month, Washington Post reports",
            "description": "The Department of Veterans Affairs plans to eliminate as many as 35,000 health-care positions this month, the Washington Post reported, citing an internal memo.",
            "category": "Politics News"
        }
    ]
}